In [1]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\smith\anaconda3\lib\site-packages (2.8.6)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import os
import pandas as pd
import matplotlib
import psycopg2
from sqlalchemy import create_engine
database_path = "Homework.sql"
engine = create_engine("postgresql://admin22:12345@localhost/SQLHomework")
conn = engine.connect()

In [3]:
departments = pd.read_sql("SELECT * FROM departments", conn)

In [12]:
salaries = pd.read_sql("SELECT * FROM salaries", conn)

In [13]:
employees = pd.read_sql("SELECT * FROM employees", conn)

In [7]:
emp_salary = pd.merge(employees, salaries, on="emp_no", how="inner")

In [8]:
emp_salary.head()

   emp_no emp_title  birth_date  first_name  last_name sex   hire_date salary
0  473302     s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28  40000
1  475053     e0002  1954-11-18       Byong  Delgrande   F  1991-09-07  53422
2   57444     e0002  1958-01-30       Berry       Babb   F  1992-03-21  48973
3  421786     s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26  40000
4  282238     e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18  40000

In [22]:
emp_salary.groupby('salary').count()

,emp_no,emp_title,birth_date,first_name,last_name,sex,hire_date
salary,,,,,,,
"Up to $25,000",0,0,0,0,0,0,0
"$25,000 to $50,000",158472,158472,158472,158472,158472,158472,158472
"$50,000 to $75,000",113534,113534,113534,113534,113534,113534,113534
"$75,000 to $100,000",26731,26731,26731,26731,26731,26731,26731

In [23]:
# Create a histogram to visualize the most common salary ranges for employees.
bins = [25000, 50000, 50000, 75000, 100000]
labels = ["Up to $50,000", "$25,000 to $50,000", "$50,000 to $75,000", "$75,000 to $100,000"]

emp_salary['salary'] = pd.cut(emp_salary['salary'], bins, labels=labels, include_lowest=True)
emp_salary.groupby('salary').count()

# Create a bar chart of average salary by title.

TypeError: '<' not supported between instances of 'int' and 'str'